"""
Теория
Говорят, что идея в том, что массив делится на отсортированную
и не отсортированную части.
Но я не могу понять чой та.
Поэтому в голове идея другая.
Мы итеррируемся по массиву, слева направо.
В каждом таком проходе мы смотрим на элементы слева от текущего.
И идем в обратную сторону (справа налево).
Если наш элемент меньше элемента слева, то он продвигается влево.
"""

import random
MyList = [random.randint(-20,20) for i in range(20)]
print(f'Рандомный список до сортировки: {MyList}')

def MyInsertionSort(arr: list):
    for i in range(1, len(arr)):
        for j in range(i, 0, -1):
            if arr[j] < arr[j-1]:
                arr[j], arr[j-1] = arr[j-1], arr[j]
    
    return arr

print(f'Отсортированный список: {MyInsertionSort(MyList)}')

"""
Рандомный список до сортировки: [0, -10, -1, 0, 20, 3, 1, -1, 1, 1, -20, -16, -15, -15, -2, -14, -15, -19, -13, 10]
Отсортированный список: [-20, -19, -16, -15, -15, -15, -14, -13, -10, -2, -1, -1, 0, 0, 1, 1, 1, 3, 10, 20]
"""