'''
Алгоритмы с двумя указателями - это общий подход к решению задач, связанных
с массивами, списками, строками и другими последовательными структурами данных.
Основная идея заключается в использовании двух указателей (индексов),
которые перемещаются по структуре данных независимо друг от друга,
позволяя эффективно исследовать различные части данных одновременно.
'''

"""Разберем на примере задачи по поиску пары с заданной суммой
в отсортированном массиве"""

"""
Задаем два индекса (левый и правый)
До тех пор, пока левый меньше правого мы считаем сумму элементов,
расположенных по индексам.
Сравниваем полученную сумму с целевой.
Если сумма равна, то возвращаем кортеж значений элементов массива.
Важно помнить, что массив отсортирован!
Если сумма меньше целевой, то смещаем ЛЕВЫЙ индекс вправо
В противном случае(если сумма больше) смещаем ПРАВЫЙ индекс влево.
"""

def find_pair_with_sum(arr, target_sum):
    left = 0
    right = len(arr)-1
    while left < right:
        current_sum = arr[left] + arr[right]
        if current_sum == target_sum:
            return (arr[left], arr[right])
        elif current_sum < target_sum:
            left += 1
        else:
            right -= 1
    return None

arr = [2, 7, 11, 15]
target_sum = 9
result = find_pair_with_sum(arr, target_sum)
print(f"Пара с суммой {target_sum}: {result}")

# Output: Пара с суммой 9: (2, 7)